CSI API ETABS v1
cSapModel.GetPresentUnits Method
 Returns a value from the eUnits enumeration indicating the units presently specified for the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
eUnits GetPresentUnits()
Function GetPresentUnits As eUnits
Dim instance As cSapModel
Dim returnValue As eUnits
returnValue = instance.GetPresentUnits()
eUnits GetPresentUnits()
abstract GetPresentUnits : unit -> eUnits
Return Value
Type: eUnits
 Returns a value from the eUnits enumeration if successful, otherwise returns zero.
Remarks
 Please note that the present units are for data transmitted through the API. They are independent of the units that are displayed in the GUI.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get present units
       Dim presentUnits as eUnits
       presentUnits = SapModel.GetPresentUnits()
   'run model (this will create the analysis model)
       ret = SapModel.Analyze.RunAnalysis
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace